app/views/contacts/_form.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = ? LIMIT ?  [["contact_id", 12], ["LIMIT", 1]]
---
      <%= address_fields.label :state %>
      <%= address_fields.select :state, options_for_state(@contact.address.state)  %>