app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)

INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 3], ["updated_at", "2017-08-23 17:51:43.055202"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)

SELECT "kinds".* FROM "kinds"
---
    def set_options_for_select
      @kind_options_for_select = Kind.all