app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.order(:description).page(params[:page]).per(15)
---
SELECT  "kinds".* FROM "kinds" ORDER BY "kinds"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "kinds" ORDER BY "kinds"."description" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 15], ["OFFSET", 0]]

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2017-08-21 19:58:17.865712"], ["updated_at", "2017-08-21 19:58:17.865712"]]

  def destroy
    @kind.destroy
---
DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 5]]

    def set_kind
      @kind = Kind.find(params[:id])
---
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]